<?php
$page = $_POST['page'];

if($page == 0){
    $list = [
        ['h3'=>'5月26日上午10点全服维护公告','span1'=>'05/26','span2'=>'公告'],
        ['h3'=>'5月19日上午9点全服维护公告','span1'=>'05/18','span2'=>'公告'],
        ['h3'=>'5月14日上午9点全服维护公告','span1'=>'05/13','span2'=>'公告']
    ];
}else if($page == 1){
    $list = [
        ['h3'=>'7月15日上午9点全服维护公告','span1'=>'07/14','span2'=>'公告'],
        ['h3'=>'6月29日上午9点全服维护公告','span1'=>'06/28','span2'=>'公告'],
        ['h3'=>'Battleye 停止更新公告','span1'=>'06/19','span2'=>'公告']
    ];
}else if($page == 2){
    $list = [
        ['h3'=>'4月9日上午9点全服维护公告','span1'=>'04/08','span2'=>'公告'],
        ['h3'=>'4月5日0点开服公告','span1'=>'04/04','span2'=>'公告'],
        ['h3'=>'4月4日停服公告','span1'=>'04/04','span2'=>'公告']
    ];
}

$result = json_encode($list);   //将数组转换成JSON格式
echo($result);